#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_logging_metric.deployment_events[0]: Refreshing state... [id=goodreads-deployment-events]
data.google_project.current: Reading...
google_service_account.cloud_run_sa: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
google_service_account.model_deployer[0]: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_monitoring_metric_descriptor.data_drift_psi[0]: Refreshing state... [id=projects/recommendation-system-475301/metricDescriptors/custom.googleapis.com/ml/goodreads/drift_psi]
google_monitoring_alert_policy.model_decay_alert[0]: Refreshing state... [id=projects/recommendation-system-475301/alertPolicies/8182456487334649045]
google_monitoring_metric_descriptor.ml_rmse[0]: Refreshing state... [id=projects/recommendation-system-475301/metricDescriptors/custom.googleapis.com/ml/goodreads/rmse]
google_monitoring_metric_descriptor.ml_accuracy[0]: Refreshing state... [id=projects/recommendation-system-475301/metricDescriptors/custom.googleapis.com/ml/goodreads/accuracy]
google_monitoring_dashboard.model_dashboard[0]: Refreshing state... [id=projects/491512947755/dashboards/03a733a9-4097-49cc-b5b1-668319734f9b]
google_logging_metric.prediction_count[0]: Refreshing state... [id=goodreads-prediction-count]
google_logging_metric.prediction_errors[0]: Refreshing state... [id=goodreads-prediction-errors]
google_monitoring_metric_descriptor.ml_mae[0]: Refreshing state... [id=projects/recommendation-system-475301/metricDescriptors/custom.googleapis.com/ml/goodreads/mae]
google_project_service.required_apis["monitoring.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/monitoring.googleapis.com]
google_monitoring_metric_descriptor.ml_r_squared[0]: Refreshing state... [id=projects/recommendation-system-475301/metricDescriptors/custom.googleapis.com/ml/goodreads/r_squared]
google_project_service.required_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/artifactregistry.googleapis.com]
google_project_service.required_apis["logging.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/logging.googleapis.com]
google_project_service.required_apis["aiplatform.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/aiplatform.googleapis.com]
google_project_service.required_apis["run.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/run.googleapis.com]
google_project_service.required_apis["bigquery.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/bigquery.googleapis.com]
google_project_service.required_apis["cloudbuild.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/cloudbuild.googleapis.com]
google_service_account.model_serving[0]: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_monitoring_alert_policy.data_drift_alert[0]: Refreshing state... [id=projects/recommendation-system-475301/alertPolicies/2340957693406637752]
google_project_iam_member.deployer_logging[0]: Refreshing state... [id=recommendation-system-475301/roles/logging.logWriter/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
data.google_project.current: Read complete after 0s [id=projects/recommendation-system-475301]
google_project_iam_member.deployer_vertex_admin[0]: Refreshing state... [id=recommendation-system-475301/roles/aiplatform.admin/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.deployer_bigquery_reader[0]: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataViewer/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.deployer_storage_admin[0]: Refreshing state... [id=recommendation-system-475301/roles/storage.admin/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_sa_bigquery_user: Refreshing state... [id=recommendation-system-475301/roles/bigquery.user/serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_sa_bigquery_data_viewer: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataViewer/serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_sa_bigquery_data_editor: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataEditor/serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com]
google_cloud_run_v2_service.recommendation_service[0]: Refreshing state... [id=projects/recommendation-system-475301/locations/us-central1/services/recommendation-service]
google_project_iam_member.serving_vertex_user[0]: Refreshing state... [id=recommendation-system-475301/roles/aiplatform.user/serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.serving_logging[0]: Refreshing state... [id=recommendation-system-475301/roles/logging.logWriter/serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_project_iam_member.serving_bigquery_reader[0]: Refreshing state... [id=recommendation-system-475301/roles/bigquery.dataViewer/serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com]
google_service_account_iam_member.deployer_can_impersonate_serving[0]: Refreshing state... [id=projects/recommendation-system-475301/serviceAccounts/goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com]
google_cloud_run_service_iam_member.public_invoker[0]: Refreshing state... [id=v1/projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/roles/run.invoker/allUsers]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/recommendation-system-475301/locations/us-central1/repositories/recommendation-service]
google_vertex_ai_endpoint.recommendation_endpoint: Refreshing state... [id=projects/recommendation-system-475301/locations/us-central1/endpoints/goodreads-recommendation-endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_service_iam_member.public_invoker[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_cloud_run_service_iam_member" "public_invoker" {
      - etag     = "BwZFTHFwG7c=" -> null
      - id       = "v1/projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/roles/run.invoker/allUsers" -> null
      - location = "us-central1" -> null
      - member   = "allUsers" -> null
      - project  = "recommendation-system-475301" -> null
      - role     = "roles/run.invoker" -> null
      - service  = "v1/projects/recommendation-system-475301/locations/us-central1/services/recommendation-service" -> null
    }

  # google_cloud_run_v2_service.recommendation_service[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_cloud_run_v2_service" "recommendation_service" {
      - annotations             = {} -> null
      - conditions              = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-12-09T21:07:33.166152Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=recommendation-system-475301&resource=cloud_run_revision/service_name/recommendation-service/revision_name/recommendation-service-00021-9sp&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22recommendation-service%22%0Aresource.labels.revision_name%3D%22recommendation-service-00021-9sp%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - reason               = ""
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
            },
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-12-09T21:07:32.949094Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=recommendation-system-475301&resource=cloud_run_revision/service_name/recommendation-service/revision_name/recommendation-service-00021-9sp&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22recommendation-service%22%0Aresource.labels.revision_name%3D%22recommendation-service-00021-9sp%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - reason               = ""
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "ConfigurationsReady"
            },
        ] -> null
      - create_time             = "2025-12-06T18:05:00.023133Z" -> null
      - creator                 = "goodreads-books@recommendation-system-475301.iam.gserviceaccount.com" -> null
      - custom_audiences        = [] -> null
      - default_uri_disabled    = false -> null
      - deletion_protection     = false -> null
      - effective_annotations   = {} -> null
      - effective_labels        = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - etag                    = "\"COKd4skGEMjZyjw/cHJvamVjdHMvcmVjb21tZW5kYXRpb24tc3lzdGVtLTQ3NTMwMS9sb2NhdGlvbnMvdXMtY2VudHJhbDEvc2VydmljZXMvcmVjb21tZW5kYXRpb24tc2VydmljZQ\"" -> null
      - generation              = "21" -> null
      - id                      = "projects/recommendation-system-475301/locations/us-central1/services/recommendation-service" -> null
      - ingress                 = "INGRESS_TRAFFIC_ALL" -> null
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      - last_modifier           = "goodreads-books@recommendation-system-475301.iam.gserviceaccount.com" -> null
      - latest_created_revision = "projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/revisions/recommendation-service-00021-9sp" -> null
      - latest_ready_revision   = "projects/recommendation-system-475301/locations/us-central1/services/recommendation-service/revisions/recommendation-service-00018-26m" -> null
      - launch_stage            = "GA" -> null
      - location                = "us-central1" -> null
      - name                    = "recommendation-service" -> null
      - observed_generation     = "21" -> null
      - project                 = "recommendation-system-475301" -> null
      - reconciling             = false -> null
      - terminal_condition      = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-12-09T21:07:33.166152Z"
              - message              = <<-EOT
                    The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=recommendation-system-475301&resource=cloud_run_revision/service_name/recommendation-service/revision_name/recommendation-service-00021-9sp&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22recommendation-service%22%0Aresource.labels.revision_name%3D%22recommendation-service-00021-9sp%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - reason               = ""
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
            },
        ] -> null
      - terraform_labels        = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - traffic_statuses        = [
          - {
              - percent  = 100
              - revision = ""
              - tag      = ""
              - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
              - uri      = ""
            },
        ] -> null
      - uid                     = "c80bc366-5120-4a90-8dc1-6fa8520fb855" -> null
      - update_time             = "2025-12-09T21:04:34.127053Z" -> null
      - uri                     = "https://recommendation-service-ndhndqk5fq-uc.a.run.app" -> null
      - urls                    = [
          - "https://recommendation-service-491512947755.us-central1.run.app",
          - "https://recommendation-service-ndhndqk5fq-uc.a.run.app",
        ] -> null

      - template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - health_check_disabled            = false -> null
          - labels                           = {} -> null
          - max_instance_request_concurrency = 320 -> null
          - service_account                  = "cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com" -> null
          - session_affinity                 = false -> null
          - timeout                          = "300s" -> null

          - containers {
              - args       = [] -> null
              - build_info = [] -> null
              - command    = [] -> null
              - depends_on = [] -> null
              - image      = "us-central1-docker.pkg.dev/recommendation-system-475301/recommendation-service/recommendation-service:adb1d5757c7592a2dabb0605f4072ddba9f541f6" -> null

              - ports {
                  - container_port = 8080 -> null
                  - name           = "http1" -> null
                }

              - resources {
                  - cpu_idle          = false -> null
                  - limits            = {
                      - "cpu"    = "4"
                      - "memory" = "8Gi"
                    } -> null
                  - startup_cpu_boost = false -> null
                }

              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }
            }

          - scaling {
              - max_instance_count = 3 -> null
              - min_instance_count = 1 -> null
            }
        }

      - traffic {
          - percent = 100 -> null
          - type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
        }
    }

  # google_compute_address.elk_static_ip[0] will be created
  + resource "google_compute_address" "elk_static_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "elk-stack-ip"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "recommendation-system-475301"
      + purpose            = (known after apply)
      + region             = "us-central1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + users              = (known after apply)
    }

  # google_compute_disk.elk_data[0] will be created
  + resource "google_compute_disk" "elk_data" {
      + access_mode                    = (known after apply)
      + create_snapshot_before_destroy = false
      + creation_timestamp             = (known after apply)
      + disk_id                        = (known after apply)
      + effective_labels               = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "project"                    = "goodreads-recommendations"
        }
      + enable_confidential_compute    = (known after apply)
      + id                             = (known after apply)
      + label_fingerprint              = (known after apply)
      + labels                         = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "goodreads-recommendations"
        }
      + last_attach_timestamp          = (known after apply)
      + last_detach_timestamp          = (known after apply)
      + licenses                       = (known after apply)
      + name                           = "elk-data-disk"
      + physical_block_size_bytes      = (known after apply)
      + project                        = "recommendation-system-475301"
      + provisioned_iops               = (known after apply)
      + provisioned_throughput         = (known after apply)
      + self_link                      = (known after apply)
      + size                           = 50
      + source_disk_id                 = (known after apply)
      + source_image_id                = (known after apply)
      + source_instant_snapshot_id     = (known after apply)
      + source_snapshot_id             = (known after apply)
      + terraform_labels               = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "project"                    = "goodreads-recommendations"
        }
      + type                           = "pd-ssd"
      + users                          = (known after apply)
      + zone                           = "us-central1-a"
    }

  # google_compute_firewall.elk_firewall[0] will be created
  + resource "google_compute_firewall" "elk_firewall" {
      + creation_timestamp = (known after apply)
      + description        = "Allow access to ELK stack ports (Elasticsearch, Kibana, Logstash)"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-elk-ports"
      + network            = "default"
      + priority           = 1000
      + project            = "recommendation-system-475301"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "elk-stack",
        ]

      + allow {
          + ports    = [
              + "9200",
              + "5601",
              + "5044",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.elk_internal[0] will be created
  + resource "google_compute_firewall" "elk_internal" {
      + creation_timestamp = (known after apply)
      + description        = "Allow internal ELK communication"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-elk-internal"
      + network            = "default"
      + priority           = 1000
      + project            = "recommendation-system-475301"
      + self_link          = (known after apply)
      + source_tags        = [
          + "elk-stack",
        ]
      + target_tags        = [
          + "elk-stack",
        ]

      + allow {
          + ports    = [
              + "9200",
              + "9300",
              + "5601",
              + "5044",
              + "9600",
            ]
          + protocol = "tcp"
        }
    }

  # google_project_iam_member.elk_sa_artifact_reader[0] will be created
  + resource "google_project_iam_member" "elk_sa_artifact_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:elk-stack-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/artifactregistry.reader"
    }

  # google_project_iam_member.elk_sa_logging[0] will be created
  + resource "google_project_iam_member" "elk_sa_logging" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:elk-stack-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.elk_sa_monitoring[0] will be created
  + resource "google_project_iam_member" "elk_sa_monitoring" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:elk-stack-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/monitoring.metricWriter"
    }

  # google_project_service.required_apis["compute.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "recommendation-system-475301"
      + service            = "compute.googleapis.com"
    }

  # google_service_account.elk_sa[0] will be created
  + resource "google_service_account" "elk_sa" {
      + account_id   = "elk-stack-sa"
      + disabled     = false
      + display_name = "ELK Stack Service Account"
      + email        = "elk-stack-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:elk-stack-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "recommendation-system-475301"
      + unique_id    = (known after apply)
    }

Plan: 9 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + elk_elasticsearch_url    = (known after apply)
  + elk_instance_ip          = (known after apply)
  + elk_kibana_url           = (known after apply)
  + elk_logstash_url         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @purva-agarwal, Action: `pull_request`, Workflow: `Terraform Infrastructure`*